Language: C/C++ Platform: Windows Arch: x86-64
Difficulty: 3.2
https://crackmes.one/crackme/69723bb7d735cd51e7a1aa78
Мой первая ВМ, так волнительно...(не первая). 
Начинаем с статистического анализа, жмём ф12 и шифт, и наблюдаем так называемые strings, ищем под микроскопом, что-то вкусненькое, а именно ""\nPlease Enter 10-char License Key: "
Вы скажите, зачем все эти трудности, когда можно в мейне просто пролистнуть, ведь начинается с мейна, а мне пофек. 
Здесь мы наблюдаем вот эту вкуснятину - 
<img width="817" height="636" alt="Image" src="https://github.com/user-attachments/assets/63861bf1-b0b8-4dba-ba64-d7777e4b5bb1" />
Вызов кол - это обработчик текста в сосноле перед букафками ввести 10 чар. 
А снизу цикл проверка введённого 10 значного чего-то, это не важно, но и в тоже время важно, но не сильно важно.
А вот снизу, мы видем зарождение жизни:
<img width="725" height="667" alt="Image" src="https://github.com/user-attachments/assets/0008155c-4cda-4a31-9793-4ad60116466e" />
Тут видим много мувов, мовзксов и снизу в самом видим колл, по-которому переходим. и уже тут видим работу под капотом от опенкодов нашей ВМ. 


